[{"time":"1.5 hours.","required-quests":"The Restless Ghost, Ernest the Chicken, Priest in Peril","required-skills":"Level 18 Slayer, Level 19 Crafting, Level 30 Ranged, Level 35 Woodcutting","reward":"1,000 Crafting, Fletching, and Slayer experience\n2,500 Woodcutting experience\nAva's attractor if your Ranged level is less than 50, or Ava's accumulator if your Ranged level is 50 or higher\nThe ability to trade with Ava and purchase her devices\n ","questPoints":"1"},{"time":"2 hours","required-quests":"Death to the Dorgeshuun, The Giant Dwarf, The Dig Site","required-skills":"Level 15 Attack, Level 25 Prayer","reward":"3,000 Mining experience\n3,000 Prayer experience\nThe ancient mace\nThe ability to buy Goblin Village teleport spheres\nFree access to the Dorgesh-Kaan–Keldagrim train system","questPoints":"1"},{"time":"4 hours","required-quests":"The Depths of Despair, The Queen of Thieves, The Ascent of Arceuus, The Forsaken Tower, Tale of the Righteous","required-skills":"Level 54 Agility, Level 52 Thieving, Level 52 Woodcutting, Level 50 Herblore, Level 42 Mining, Level 38 Crafting, Level 35 Magic","reward":"The book of the dead\nAn antique lamp giving 10,000 experience to any skill level 40 or above.\nAbility to set your respawn point to Kourend Castle. Talk to Asteros Arceuus, now found on the 1st floor[UK] of Kourend Castle, to change your respawn point at any time.\n24 new spells made available in the Arceuus spellbook (all combat spells with the exception of Ghostly Grasp and Inferior Demonbane, and all utility spells with the exception of Resurrect Crops and reanimation spells).","questPoints":"2"},{"time":"3.5 hours","required-quests":"A Taste of Hope","required-skills":"Others: 90+ Combat level is highly recommended! You must have Ivandis flail or Blisterwood flail in bank.","reward":"Three antique lamps giving 20,000 experience to any combat skill level 50 or above, excluding Prayer.","questPoints":"2"},{"time":"1 hours","required-quests":"Reward:","required-skills":"5,000 coins","reward":"5,000 coins\n1,000 Slayer experience\n30 Slayer reward points\nAccess to the Sourhog Cave and Sourhog slayer tasks from Spria or Turael.\nExisting slayer helmets will have reinforced goggles added to them.","questPoints":"1"},{"time":"1 hour","required-quests":"Reward:","required-skills":"500 Defence experience","reward":"500 Defence experience\n500 Hitpoints experience\n500 Coins\nAccess to the Dungeon of Tolna","questPoints":"1"},{"time":"2 hours","required-quests":"Icthlarin's Little Helper","required-skills":"Reward:","reward":"A Doctor's hat or Nurse hat (you can switch by destroying your hat and requesting a new one from the Apothecary)\nA present containing:\nTwo antique lamps worth 2,500 experience each in skills of your choice over 30\nA Mouse toy (can be used to play with your cat, and functions as a fun weapon at the Duel Arena)\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"2"},{"time":"3 hours","required-quests":"Darkness of Hallowvale","required-skills":"Level 48 Crafting, Level 45 Agility, Level 40 Attack, Level 40 Herblore, Level 38 Slayer. For boss fightings,  Level 70+ Attack, Strength and Defense are recommended.","reward":"Ivandis flail - A weapon that can damage the vyrewatch\nDrakan's medallion - An amulet that gives the player unlimited teleports to the Theatre of Blood\nTome of experience, granting 2,500 experience to any three skills of the player's choosing (level 35 or over). Can be the same skill.","questPoints":"1"},{"time":"1 hour.","required-quests":"Reward:","required-skills":"2,000 coins\nAccess to the Ruins of Camdozaal\nFlex emote\nThe ability to make a steak sandwich","reward":"2,000 coins\nAccess to the Ruins of Camdozaal\nFlex emote\nThe ability to make a steak sandwich","questPoints":"2"},{"time":"1 hours","required-quests":"Skills: None","required-skills":"Quests: 13 Quest Points","reward":"","questPoints":"3"},{"time":"2 hours","required-quests":"Contact!","required-skills":"Level 62 Agility, Level 55 Crafting, Level 55 Firemaking, High Combat level is recommended.","reward":"20,000 Agility experience\nAccess to the Tombs of Amascut\nA Keris partisan\nThe ability to upgrade the Keris to the Keris partisan\nThe circlet of water, an untradeable helm that acts like a waterskin when worn\nAccess to a fairy ring on a small island south-west of Necropolis, code a k p. (Unlocked when entering Necropolis during the beginning of the quest.)\nJaltevas teleport option on the Pharaoh's sceptre. Unlocked by selecting Commune on an obelisk in the Necropolis area.","questPoints":"2"},{"time":"2 hours","required-quests":"Fishing Contest, Dwarf Cannon.","required-skills":"Level 30 Defence, Level 40 Mining (higher mining being an advantage), Level 50 Smithing, ability to defeat at least a level 75 enemy.","reward":"5,000 Defence experience\n5,000 Mining experience\n5,000 Smithing experience\nA rune pickaxe\nThe ability to teleport to Dondakan's rock using a ring of wealth\nYou get to keep your gold helmet and can continue using it to fire yourself into the rock to access the Arzinian Mine where there are lots of gold rocks and gold veins, and a nearby dwarf banks the player's gold ore for a charge (he keeps 20% of the ores, rounded up, or 10% of the ores if the player has the ring of charos (a)).","questPoints":"2"},{"time":"2 hours","required-quests":"Skills: Level 5 Fletching, Level 30 Cooking, Level 30 Ranged","required-skills":"Reward:","reward":"262 Fletching experience\n1,470 Cooking experience\n735 Ranged experience\nAn ogre bow\nThe ability to fletch ogre arrows\nThe ability to cook chompy birds and earn a bowman hat","questPoints":"2"},{"time":"2 hours","required-quests":"Plague City","required-skills":"Reward:","reward":"1,250 Thieving experience\nUse of the Combat Training Camp north of the city. Players can attack a total of six training dummies in the camp for 50 attack experience each.\nThe ability to travel freely through the West Ardougne gate.\nThe ability to use the West Ardougne Teleport in the Arceuus spellbook and teletab.","questPoints":"3"},{"time":"1.5 hours","required-quests":"The Dig Site","required-skills":"Others: 100 Kudos","reward":"Access to Fossil Island - to disembark the boat upon arrival at Fossil Island, speak to the Junior Navigator.\nFossil island note book","questPoints":"1"},{"time":"1 hours","required-quests":"Reward: 300 Cooking experience, Permission to use the Cook-o-matic 100, which reduces the chance of burning some foods.","required-skills":"Quest points gained upon completion:  1","reward":"","questPoints":"1"},{"time":"2 hours","required-quests":"Rum Deal, Pirate's Treasure, Priest in Peril","required-skills":"42 Agility, 45 Crafting, 50 Smithing and 40 Ranged","reward":"7,000 Crafting experience\n7,000 Smithing experience\n7,000 Agility experience\n10,000 coins (only if you speak to Bill Teach after the quest)\nAccess to Mos Le'Harmless\nAccess to kill cave horrors\nThe Book o' piracy\nCharter ship prices are halved\nAbility to play the Trouble Brewing minigame","questPoints":"2"},{"time":"1.5 hours.","required-quests":"Quest: X Marks the Spot","required-skills":"Reward:","reward":"Two antique lamps which provide 500 XP each in a skill of the player's choosing.\nKourend favour certificate. Reading it grants 20% favour towards a city of your choosing.\nA good choice for the favour reward (if not at 30% already) is Port Piscarilius since the first 30% is both semi-expensive, and time consuming.\nKharedst's memoirs","questPoints":"1"},{"time":"1 hours","required-quests":"Reward: 500gp","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"2 hours","required-quests":"Skills: Level 10 Hunter, Level 30 Agility, Level 30 Crafting, Level 34 Construction, Level 15 Thieving, Access to a crafting table 3","required-skills":"Others: You will need to have a Player Owned House with a Workshop room that has a Crafting Table 3.","reward":"2,000 Crafting experience\n5,000 Agility experience\n1,500 Construction experience\nThe ability to make the penguin suit. To enter the suit again, you must talk to Larry again at the zoo, pier, Iceberg, or Lumbridge sheep pen.\nThe ability to use the Penguin agility course\nPlayers can also steal more cowbells and make more bongos. The cowbells or the bongos can only be played in a penguin suit.","questPoints":"1"},{"time":"2 hours","required-quests":"Prince Ali Rescue, Icthlarin's Little Helper","required-skills":"Reward:","reward":"7,000 Thieving experience\nCombat lamp giving two wishes granting 7,000 experience to Attack, Strength, Defence, Hitpoints, Ranged, or Magic\nThe Keris dagger\nAccess to Sophanem's bank\nThe music track Back to Life","questPoints":"1"},{"time":"2 hours","required-quests":"Skills: 25 thieving, 20 crafting, ability to defeat lvl 51 monster and run past level 72 monsters","required-skills":"Quests: Priest in Peril, The Restless Ghost","reward":"1,000 Thieving experience\nThe Ring of charos, which allows access to the Werewolf Agility Course, and, when activated during Garden of Tranquillity, reduced cost to many transport links.","questPoints":"2"},{"time":"1 hours","required-quests":"Reward: Silverlight (if lost, players may retrieve it from Sir Prysin for a fee of 500 coins. It can also be sold to the Wise Old Man for 80 coins.)","required-skills":"Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum","reward":"Completing this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum","questPoints":"3"},{"time":"1 hours","required-quests":"Reward:  1300 mining exp, 180 gold coins, permission to use Doric's anvils.","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"3 hours","required-quests":"Reward:  18,650 Strength XP, 18,650 Defence XP, The ability to wear Rune platebody and Green dragonleather body, access to Crandor and the Corsair Cove Resource Area.","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"4 hours","required-quests":"In Aid of the Myreque","required-skills":"Level 5 Construction, Level 20 Mining, Level 22 Thieving, Level 26 Agility, Level 32 Crafting, Level 33 Magic, Level 40 Strength, The ability to withstand several melee attacks from a level 169 enemy.","reward":"7,000 Agility experience\n6,000 Thieving experience\n2,000 Construction experience\nTome of experience, granting 2,000 experience to any three skills of the player's choosing (level 30 or over). Can be the same skill.","questPoints":"2"},{"time":"1.5 hours","required-quests":"Reward:","required-skills":"3,000 Attack experience","reward":"3,000 Attack experience\nSteel claws\nThe ability to make claws\nAbility to purchase and wear climbing boots from Tenzing","questPoints":"1"},{"time":"3 hours","required-quests":"Skills: Level 23 Agility and Level 23 Thieving, The ability to defeat a level 50 enemy with Melee or Magic.","required-skills":"Quests: The Lost Tribe","reward":"2,000 Thieving experience\n2,000 Ranged experience\nYou are granted access to the Dorgeshuun city!\nAccess to the H.A.M. Store room, where you can loot gems, jewellery, and coins from chests.\nAccess to the water wheel tunnel (Dartog will appear there, and you'll be able to travel between the Lumbridge Castle cellar, the Dorgeshuun Mines and the water wheel tunnel at will).\nAbility to use the bone dagger and Dorgeshuun crossbow special attacks.\nAccess to Dorgesh-Kaan, the Dorgeshuun city\nA torch if you did not have a light source in your inventory at the end of the quest.","questPoints":"1"},{"time":"5 hours","required-quests":"Skills: Level 10 Slayer, 50 Firemaking, 50 Magic, 53 Thieving, 43 prayer is required especially for pure","required-skills":"Quests: The Dig Site, The Tourist Trap, Temple of Ikov, Priest in Peril, Waterfall Quest, Troll Stronghold","reward":"20,000 Magic experience\nThe ability to use Ancient Magicks: At any time, you can pray at the altar and change between the standard and Ancient Magicks spellbooks. After traversing the pyramid for the first time, you may enter via the back-door of the pyramid to gain a short cut to the altar. Be warned that changing spellbooks will drain your prayer to 0.\nRing of visibility: If you ever lose it, you can obtain another one from Rasolo.\nAccess to the Curse of the Empty Lord miniquest (only requires the ring of visibility).\nAccess to ancient staff: You can also buy one from Eblis for 80,000 coins. If you lose the staff, you will have to kill mummies inside the pyramid, or buy it from other players. It can also be obtained as a rare drop from the Chaos Fanatic, as a rare drop from the Thermonuclear smoke devil or as an uncommon drop from Vet'ion.\nAccess to the Smoke Dungeon, which can be used for various Slayer tasks.\nAbility to talk to Eblis to obtain an ancient signet.","questPoints":"3"},{"time":"2 hours","required-quests":"Wanted!, Troll Stronghold, Doric's Quest, The Miniquest Enter the Abyss","required-skills":"Level 65 Smithing, Level 50 Fletching, Level 50 Runecrafting","reward":"5,000 Fletching experience\n5,000 Runecraft experience\n6,500 Smithing experience","questPoints":"1"},{"time":"6 hours","required-quests":"200 Quest Points, Legends' Quest, Dream Mentor, A Tail of Two Cats, Animal Magnetism, Ghosts Ahoy, Bone Voyage, Client of Kourend","required-skills":"75 Magic, 70 Smithing, 68 Mining, 62 Crafting, 60 Agility (Higher recommended), 60 Thieving (Higher recommended), 50 Construction, and 50 Hitpoints. Note that all skills are no boosts allowed.","reward":"25,000 Smithing experience\n18,000 Mining experience\n15,000 Agility experience\n15,000 Thieving experience\nAbility to speak to cats without the Catspeak amulet.\nAccess to the Myths' Guild.\nAbility to make Super antifire potions by speaking to Primula.\n4x 25,000 experience in Magic, Ranged, Strength, Attack, Defence or Hitpoints by speaking to Ellen.\nAccess to Fountain of Uhld where dragonstone jewellery (excluding the ring of wealth) can be recharged.\nAccess to the Pool of Dreams where players can refight Galvek or rewatch cutscenes from the quest.\nAccess to the wrath altar.\nAccess the shop to buy the Mythical cape.\nAccess to the pettable dog.\nAccess to adamant and rune dragons in the Lithkren Vault.\nAccess to a stronger version of Vorkath on Ungael.\nAbility to reforge the dragon platebody and kiteshield.\nAbility to have a rune dragon as a Treasure Room guardian (requiring 99 Construction and 25,000,000 coins).\nAbility to create Ava's assembler by bringing Vorkath's head, 75 Mithril arrows, and 4,999 gp (or Ava's accumulator) to Ava in Draynor Manor.\nAbility to craft Ferocious gloves from Hydra leather in the Lithkren Vault (requires a hammer).\nAbility to construct Mythical cape (mounted) in your POH.\nAbility to go back through the grandiose doors on Lithkren and use your Digsite pendant on the Strange Machine north of the dragons. This will allow you to teleport there.\nLocator orb","questPoints":"5"},{"time":"4 hours","required-quests":"Lunar Diplomacy, Eadgar's Ruse","required-skills":"Level 85 Combat, The ability to defeat 4 powerful monsters without the use of prayer.","reward":"15,000 Hitpoints experience\n10,000 Magic experience\n7 new spells added to your Lunar spells book (Monster Examine, Humidify, Hunter Kit, Stat Spy, Dream, Plank Make, Spellbook Swap).\nA dreamy lamp, which awards 15,000 experience in a combat skill of a player's choosing, apart from Attack and Prayer.\n'Birds-Eye' Jack will now allow you to use the bank without a seal of passage equipped or in your inventory.","questPoints":"2"},{"time":"1 hours","required-quests":"Reward:  Ability to use the Herblore Skill and 250 herblore experience.","required-skills":"Quest points gained upon completion: 4","reward":"","questPoints":"4"},{"time":"1 hours","required-quests":"Reward:","required-skills":"750 Crafting experience","reward":"750 Crafting experience\nThe ability to buy and use a dwarf multicannon\nThe ability to make cannonballs","questPoints":"1"},{"time":"1 hours","required-quests":"Reward: 3000gp, Access to the Killerwatt Plane (Members only)","required-skills":"Quest points gained upon completion: 4","reward":"","questPoints":"4"},{"time":"2 hours","required-quests":"Skills: 31 Herblore","required-skills":"Quests: Druidic Ritual, Troll Stronghold","reward":"11,000 Herblore experience\nThe ability to grow and steal Goutweed, which can be traded with Sanfew for herbs.\n1 Burnt Meat\nThe ability to use the Trollheim Teleport spell.\nThe ability to use a Scroll of redirection to redirect a Teleport to house tablet to Trollheim.","questPoints":"1"},{"time":"2 hours","required-quests":"Skills: Level 27 Hunter","required-skills":"Reward:","reward":"2500 Hunter experience\nAbility to use box traps.\nAccess to the Eagle transport system.\nCaptured ferrets can be used to flush rabbits from their holes, allowing them to be caught in rabbit snares.\nA box trap","questPoints":"2"},{"time":"1.5 hours","required-quests":"Skills: Level 20 Mining (30 if you want to mine your own coal), Level 20 Smithing, Level 20 Crafting","required-skills":"Reward:","reward":"5,000 Crafting experience\n5,000 Smithing experience\nAccess to the Elemental Workshop.\nAn elemental shield, as well as the ability to make and wield them.","questPoints":"1"},{"time":"1.5 hours","required-quests":"Elemental Workshop I","required-skills":"Level 20 Magic, Level 30 Smithing","reward":"7,500 Smithing experience\n7,500 Crafting experience\nThe ability to make and use elemental mind equipment.","questPoints":"1"},{"time":"2 hours","required-quests":"Skills: Level 50 Crafting, Level 45 Firemaking, Level 43 Prayer and Level 39 Magic","required-skills":"Reward:","reward":"7,000 Crafting experience\n7,000 Mining experience\n7,000 Firemaking experience\n7,000 Magic experience\nCamulet, which allows you to talk to camels and teleport to the temple four times. It can be recharged by using camel dung on it. You can pay Lazim 1 million gold pieces to give it unlimited charges.\nCamel mask (Use a piece of soft clay on the pedestal with the globes on it to make.)","questPoints":"2"},{"time":"2 hours","required-quests":"20 Quest Points","required-skills":"Level 20 Firemaking, Level 30 Farming, Level 36 Crafting","reward":"2,000 Crafting experience\n3,000 Farming experience\n1,500 Woodcutting experience\n4,000 Firemaking experience\nThe Bomber jacket and cap.\nGnome goggles from the Gnome Restaurant minigame can be combined with the bomber cap by talking with Auguste.\nAccess to the balloon transport system.\nAbility to make origami balloons.","questPoints":"1"},{"time":"2 hours","required-quests":"Lost City, Nature Spirit","required-skills":"The ability to defeat a level 111 Tanglefoot with limited weaponry.","reward":"Magic secateurs (increases crop harvests by 10% when Farming)\n3,500 Farming experience\n2,000 Attack experience\n1,000 Magic experience","questPoints":"2"},{"time":"2 hours","required-quests":"Fairy Tale I - Growing Pains","required-skills":"Level 57 Herblore, Level 49 Farming, Level 40 Thieving","reward":"3,500 Herblore experience\n2,500 Thieving experience\nAn antique lamp granting 2,500 experience in any skill over level 30\nAccess to the fairy rings network\nAccess to Fairy Fixit's Fairy Enchantment shop","questPoints":"2"},{"time":"2 hours","required-quests":"Skills: Level 40 Mining, 40 Smithing, 59 Magic and 40 Crafting.","required-skills":"Reward:","reward":"Steel gauntlets\nCooking gauntlets (Caleb): Reduces the chance of burning certain fish significantly: (lobsters, swordfish, monkfish, sharks and anglerfish).\nGoldsmith gauntlets (Avan): Increases the Smithing experience from smelting gold by 150% - from 22.5 to 56.2.\nChaos gauntlets (Johnathon): Increases the damage done by bolt (chaos rune) spells by 3. Stacks multiplicatively with the Tome of Fire and Slayer helmet (i), the former having a moderate upkeep cost, for a maximum hit of 25, which is by far the highest damage per second for a beginner.\nAfter the Family Pest miniquest, you can have all three gauntlets for 500,000 coins.","questPoints":"1"},{"time":"1.5 hours","required-quests":"Skills: Be able to kill level 112 and 137 monsters","required-skills":"Reward:","reward":"12,175 Attack experience\n2,175 Thieving experience\n1,000 coins\nThe Khazard armour","questPoints":"2"},{"time":"1 hours","required-quests":"Skills: Level 10 fishing.","required-skills":"Reward:","reward":"2,437 Fishing experience\nAccess to the underground White Wolf Mountain passage.\nAbility to catch minnows in the Fishing Guild with 82 Fishing and a full Angler's outfit.","questPoints":"1"},{"time":"2 hours","required-quests":"Skills: Level 17 Farming, Level 22 Cooking","required-skills":"Quests: The Giant Dwarf, Fishing Contest","reward":"5,000 Cooking experience\nFarming 5,000 Farming experience\n2 Dwarven stout (m)","questPoints":"2"},{"time":"1 hour","required-quests":"Reward: A Gold bar, 200 Crafting exp.","required-skills":"Quest points gained upon completion: 5","reward":"","questPoints":"5"},{"time":"3 hours","required-quests":"Skills: Level 25 Farming","required-skills":"Quests: Creature of Fenkenstrain","reward":"5,000 Farming experience\nAn activated ring of charos - players can wear the activated ring to charm various NPCs to pay less for certain services, or get choices that are otherwise unavailable.\nAn apple tree seed\nAn acorn\n5 guam seeds\n4-dose compost potion, can be used on a full compost bin to turn compost into supercompost.\nAfter the quest, the player can visit the garden and pick 4 fruits from the white tree. They regrow after some time, similar to other fruit bearing trees. Each fruit restores about 8% of energy.","questPoints":"2"},{"time":"1 hours","required-quests":"Reward:","required-skills":"1,525 Cooking experience","reward":"1,525 Cooking experience\nYour own kitten\nChocolate cake\nStew\nGertrude will now sell kittens for you to raise for 100 coins each.","questPoints":"1"},{"time":"1.5 hours","required-quests":"Skills: Level 30 Crafting, Level 26 Construction","required-skills":"Reward:","reward":"3,000 coins - If not claimed at quest completion due to no available inventory space, talk to Gordon again after the quest for the reward.\n4,000 Crafting experience\n3,200 Construction experience\nAccess to a tannery in the Kebos Lowlands (speak to Mary to access tanning services).","questPoints":"1"},{"time":"1 hours","required-quests":"Priest in Peril, The Restless Ghost","required-skills":"25 Agility, 20 Cooking","reward":"2,400 Prayer experience\nFree passage into Port Phasmatys\nThe Ectophial, which allows direct teleport to the Ectofuntus, is refilled from the Ectofuntus. (must have obtained ghostspeak amulet)","questPoints":"2"},{"time":"2 hours","required-quests":"Witch's House","required-skills":"Level 45 Farming, Level 52 Herblore, Level 58 Thieving, Level 59 Agility, Level 71 Woodcutting, Ability to defeat a level 138 cloud giant - Glod.","reward":"4,000 Farming experience\n5,000 Herblore experience\n5,000 Hitpoints experience\n14,000 Woodcutting experience\nAgility 6,000 Agility experience\n6,000 Thieving experience\nDwarven helmet (equip this helmet in the Dwarven Mines to complete a Hard Falador task)","questPoints":"1"},{"time":"2 hours","required-quests":"Priest in Peril","required-skills":"Level 35 Crafting, The ability to defeat a level 95 enemy.","reward":"22,000 Strength experience\nThe ability to make the Salve amulet, which when equipped gives combat bonuses against undead monsters.\nAccess to a shortcut to the crystal outcrops.\nAccess to Tarn's Lair.","questPoints":"2"},{"time":"1 hours","required-quests":"Reward:","required-skills":"1500 Thieving experience","reward":"1500 Thieving experience\n2000 coins (plus 5 from the fake ending if you sided with the Carnillean family)\nHazeel's mark (if you sided with Hazeel)\nCarnillean armour (if you sided with Ceril and obtained an extra during the quest)\n5 Kudos, which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"1"},{"time":"3 hours","required-quests":"Shield of Arrav, Lost City, Merlin's Crystal, Dragon Slayer I, 55 Quest Points","required-skills":"Level 25 herblore, 50 Mining (49 if you use dwarven stout), 53 Fishing, 53 Cooking","reward":"3,075 Attack experience\n3,075 Defence experience\n3,075 Strength experience\n3,075 Hitpoints experience\n2,075 Ranged experience\n2,725 Fishing experience\n2,825 Cooking experience\n1,575 Woodcutting experience\n1,575 Firemaking experience\n2,257 Smithing experience\nMining 2,575 Mining experience\n1,325 Herblore experience\nAccess to the Heroes' Guild.\nThe ability to purchase and wield dragon battleaxes and maces.\nAbility to utilise the Fountain of Rune.\nAbility to use Charge dragonstone jewellery scrolls.\nAccess to the Fountain of Heroes, where players can recharge their amulets of glory.","questPoints":"1"},{"time":"2 hours","required-quests":"Merlin's Crystal","required-skills":"20 Attack","reward":"11,000 Prayer experience\n15,300 Defence experience\nAccess to the Fisher Realm.\nAbility to put King Arthur picture on the wall in the Construction skill.","questPoints":"2"},{"time":"1.5 hours","required-quests":"Skills: 35 agility, The ability to kill a level 100 monster.","required-skills":"Others: Alfred Grimhand's Barcrawl","reward":"4662 Magic experience\n4662 Strength experience\n4662 Ranged experience\nA damaged book of your choice which, when complete, will become: a Holy book (Saradomin), an Unholy book (Zamorak), or a Book of balance (Guthix).\nSince 3 March 2016, it is possible to purchase all the damaged books from Jossik for 5,000 coins each, even if you have not filled your other book(s).\nAccess to the Lighthouse general store and the Dagannoth caves underneath. (There are level 74 and 92 dagannoth. Both use a Ranged attack that has low accuracy, but the level 92 ones will try to use their much more effective Melee attack whenever they can.)","questPoints":"2"},{"time":"1 hour","required-quests":"Reward: Amulet of accuracy, 875 Magic exp. After the quest players can obtain more amulets by speaking to Wizard Mizgog with a complete set of beads.","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"2 hours","required-quests":"Gertrude's Cat","required-skills":"Be able to defeat a level 91 monster.","reward":"4,500 Thieving experience\n4,000 Agility experience\n4,000 Woodcutting experience\nCatspeak amulet\nAccess to the city of Sophanem.\nUnlock the carpet rides from Pollnivneach to Sophanem and Menaphos.","questPoints":"2"},{"time":"2 hours","required-quests":"In Search of the Myreque","required-skills":"Level 25 Agility, Level 25 Crafting, Level 15 Mining, Level 7 Magic","reward":"2,000 Attack experience\n2,000 Strength experience\n2,000 Crafting experience\n2,000 Defence experience\nAccess to the Temple Trekking minigame.\nA Gadderhammer from defeating Gadderanks.\nThe ability to make the Rod of Ivandis.\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"2"},{"time":"2 hours","required-quests":"Nature spirit","required-skills":"Level 25 Agility, The ability to defeat a level 97 skeleton dog.","reward":"600 Attack experience\n600 Defence experience\n600 Strength experience\n600 Hitpoints experience\n600 Crafting experience\nA quick route to Mort'ton","questPoints":"2"},{"time":"1.5 hours","required-quests":"Druidic Ritual","required-skills":"Level 3 Herblore","reward":"","questPoints":"1"},{"time":"2.5 hours","required-quests":"Black Knights' Fortress, Holy Grail, Murder Mystery, One Small Favour","required-skills":"Level 45 Magic, Level 65 Defence","reward":"33,000 experience\n5,000 experience\nAntique lamp granting 5,000 experience to any skill level 50 or above.\nAccess to the Knight Waves Training Grounds.\nThe ability to use the Chivalry and Piety prayers, with level 60 and 70 Prayer, respectively, after completion of Knight Waves Training Grounds.","questPoints":"1"},{"time":"2 hours","required-quests":"Another Slice of H.A.M., Fishing Contest","required-skills":"Level 38 Agility, Level 40 Fishing, Level 45 Thieving, Level 48 Herblore, Level 60 Combat","reward":"8,000 Agility experience\n8,000 Fishing experience\n8,000 Thieving experience\n8,000 Herblore experience\nAccess to the Goblin Temple (with an altar to recharge prayer points).\nAccess to Yu'biusk, using fairy ring code blq.\nAbility to purchase Plain of mud spheres that transports you to the Goblin Cave.\nAbility to make goblin potions.","questPoints":"2"},{"time":"4 hours","required-quests":"Heroes' Quest, Family Crest, Shilo Village, Underground Pass, Waterfall Quest, 107 Quest Point","required-skills":"Level 52 Mining, Level 50 Agility, Level 50 Crafting, Level 50 Smithing, Level 50 Strength, Level 50 Thieving, Level 42 Prayer, Level 56 Magic, Level50 Woodcutting, Level 45 Herblore","reward":"Access to the Legends' Guild (including shop to buy the cape of legends).\nThe ability to wield the dragon sq shield.\n7,650 experience each in four skills of your choice (limited to Attack, Defence, Strength, Hitpoints, Prayer, Magic, Woodcutting, Crafting, Smithing, Herblore, Agility, Thieving. It is possible to choose the same skill several times).\nThe ability to charge your Skills necklace or Combat bracelet at the Legends' Guild or the Fountain of Rune.\nAccess to the Kharazi Jungle and a vine shortcut into it, requiring 79 Agility.\nRadimus Erkle will provide replacement dark daggers, which can be investigated via right-click to switch appearance between a dark or glowing dagger.","questPoints":"4"},{"time":"1 hours","required-quests":"Skills: Level 31 Crafting, Level 36 Woodcutting, The ability to kill a level 101 Tree Spirit without weapons.","required-skills":"Reward:","reward":"Access to Zanaris.\nAbility to buy and wield dragon longswords and dragon daggers (with level 60 Attack).\nAbility to make Cosmic runes with the Runecraft skill.","questPoints":"3"},{"time":"3 hours","required-quests":"The Fremennik Trials, Lost City, Rune Mysteries, Shilo Village","required-skills":"Level 61 Crafting, Level 40 Defence, Level 49 Firemaking, Level 5 Herblore, Level 65 Magic, Level 60 Mining, Level 55 Woodcutting","reward":"5,000 Magic experience\n5,000 Runecraft experience\nA seal of passage\nAccess to Lunar Isle and Lunar equipment.\nAccess to the Lunar spellbook.\nAccess to the Astral altar.\n50 Astral runes","questPoints":"2"},{"time":"1 hours","required-quests":"Reward: Uncut ruby, Uncut emerald, Uncut sapphire, 600 crafting exp","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"2 Hours","required-quests":"My Arm's Big Adventure, Swan Song, Cold War, Romeo & Juliet","required-skills":"Level 66 Firemaking, Level 72 Mining, Level 35 Construction, Level 68 Agility (Higher Agility level is recommended.)","reward":"2,000 Construction experience\n5,000 Firemaking experience\n10,000 Mining experience\n10,000 Agility experience\nAccess to the Salt Mines.\nAbility to build fire pits.\nA new disease-free herb patch in Weiss (requires building the fire of nourishment before use).\nAbility to direct a teleport room portal to Troll Stronghold with a combination of salt.","questPoints":"2"},{"time":"1 hours","required-quests":"Priest in Peril, The Restless Ghost","required-skills":"Reward:","reward":"1,000 Crafting experience\n1,000 Prayer experience\n750 Coins\nEnchanted key, allowing you to go on your own treasure digs until it disappears.\nAccess to the museum in the outpost.\nAbility to complete master clue hot/cold Treasure Trails.\nAbility to claim 5 Kudos and an antique lamp for 1,000 experience (in any skill over level 20) by talking to Historian Minas in the Varrock Museum.","questPoints":"3"},{"time":"1 hours","required-quests":"Reward:","required-skills":"Excalibur (Required for Holy Grail quest.)","reward":"Excalibur (Required for Holy Grail quest.)\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"6"},{"time":"1 hours","required-quests":"Reward:","required-skills":"2,000 Woodcutting experience\n8 Law runes\nBrother Omad will throw parties for you by speaking to him.","reward":"2,000 Woodcutting experience\n8 Law runes\nBrother Omad will throw parties for you by speaking to him.","questPoints":"1"},{"time":"3 hours","required-quests":"The Grand Tree, Tree Gnome Village","required-skills":"None but a Prayer level 43 is highly recommended (especially for pures). The ability to defeat a Level 195 Demon (ranging is better for fighting).","reward":"10,000 Coins\n3 Diamonds\nSpeaking to Daero after the quest gives the choice of either, 35,000 experience in Attack and Defence and 20,000 experience in Strength and Hitpoints OR 35,000 experience in Strength and Hitpoints and 20,000 experience in Attack and Defence. Returning to Ape Atoll after completing the quest requires undergoing Daero's training.\nThe ability to buy and wield the Dragon scimitar.\nThe ability to turn into a monkey in Ape Atoll & Ardougne Zoo, using the Monkey greegree.\nFull access to Ape Atoll. (Bank is unlocked after Monkey Madness II.)","questPoints":"3"},{"time":"4 hours.","required-quests":"Skills: Level 69 Slayer, Level 70 Crafting, Level 60 Hunter, Level 55 Agility, Level 55 Thieving, Level 60 Firemaking, High combat level, and Agility level are recommended","required-skills":"Quests: Enlightened Journey (you must unlock the grand tree destination for Balloon transport system and level 60 firemaking is a requirement)","reward":"25,000 Slayer experience\n20,000 Agility experience\n15,000 Thieving experience\n15,000 Hunter experience\nAccess to the Crash Site Cavern containing Demonic Gorillas.\nThe ability to communicate with monkeys without the monkeyspeak amulet.\nAll NPCs on the surface of Ape Atoll will be non-aggressive without requiring the use of Monkey greegrees.\nAccess to Ape Atoll bank and Oobapohk's Javelin Store.\nAccess to new glider spot directly to Ape Atoll.\n2x 50,000 experience rewards from Duke in your choice of Magic, Ranged, Attack, Defence, Strength, or Hitpoints. Found on the hill east of the main gate of Ape Atoll. (Walk-up west hill, and climb the ladder to reach the east hill.)\nAbility to wield the Heavy ballista.\nA Royal seed pod, which provides unlimited teleports to the Grand Tree (up to level 30 Wilderness).\nA Monkey can be found in one of the crates at the Crash Site. It is purely cosmetic and can be equipped in the cape slot.\nBobawu will now track your laps of the Ape Atoll Agility Course, with you being able to transform your monkey into other variants upon completing several laps.\nThe ability to re-fight Glough by gazing into the Burning brazier in Zooknock's house.\nThe ability to reclaim lost Greegrees from Zooknock in his Gnome Stronghold house (no supplies required).\nAccess to a new maniacal monkey hunting area where Glough's laboratory used to be in Kruk's Dungeon.\nVarious dragons will now drop dragon javelin heads.","questPoints":"4"},{"time":"1.5 hours","required-quests":"Skills: Level 20 agility, The ability to defeat a level 70 monster.","required-skills":"Reward:","reward":"2,000 Prayer experience\n1,000 Attack experience\nThe Bearhead\nThe ability to pass into the Mountain Camp over the rockslide.","questPoints":"2"},{"time":"3 hours","required-quests":"Sheep Herder, Roving Elves, Big Chompy Bird Hunting","required-skills":"Level 50 Thieving, Level 60 Ranged","reward":"25,000 Thieving experience\n25,000 Hitpoints experience\nAccess to the Mourner HQ basement and the village of Lletya.\nElf teleport crystal\nThe fixed device\nFull mourner clothing","questPoints":"2"},{"time":"3.5 hours","required-quests":"Mourning's Ends - Part I","required-skills":"Reward:","reward":"20,000 Agility experience\nA crystal trinket, which allows you to enter the Temple of Light again after the quest.\nA death talisman, and the ability to craft death runes (you'll get full access to the abyssal rift as well).\nAccess to Dark Beasts.","questPoints":"2"},{"time":"1.5 hours","required-quests":"Reward:","required-skills":"1,406 Crafting experience","reward":"1,406 Crafting experience\n2,000 Coins","questPoints":"3"},{"time":"2 hours","required-quests":"Eadgar's Ruse, Jungle Potion, The Feud","required-skills":"Level 29 Farming, Level 10 Woodcutting","reward":"10,000 Herblore experience\n5,000 Farming experience\nAccess to a disease-free herb patch on top of the Troll Stronghold. This patch does not allow growing of regular Goutweed.\n29 Burnt meat","questPoints":"1"},{"time":"1.5 hours","required-quests":"Priest in Peril, The Restless Ghost","required-skills":"Reward:","reward":"3,000 Crafting experience\n2,000 Defence experience\n2,000 Hitpoints experience\nAccess to Mort Myre Swamp and the Nature Spirit altar, where you can replenish and temporarily boost your prayer points by 2.\nAbility to fight ghasts.\n3 meat pies and 3 apple pies unless they were rotted by the ghasts.\nAbility to build Fire of Dehumidification after completion of Making Friends with My Arm.","questPoints":"2"},{"time":"1 hours","required-quests":"Reward:","required-skills":"2,250 Crafting experience","reward":"2,250 Crafting experience\nYour item reward depends on what astrological sign you see when you look through the telescope. It is different for each person. Each one rewards an uncut sapphire as well as the following:\nAquarius: 25 water runes\nAries: 875 Attack experience\nCancer: An amulet of defence\nCapricorn: 875 Strength experience\nGemini: A black 2h sword\nLeo: 875 Hitpoints experience\nLibra: 3 law runes\nPisces: 3 tuna\nSagittarius: A maple longbow\nScorpio: Weapon poison\nTaurus: A 1-dose super strength potion\nVirgo: 875 Defence experience\nThe Spirit of Scorpius will now give you a mould to make unholy symbols, and he will bless them for you too. He can be found in the graveyard north of the Observatory.\nTalk to the Observatory assistant after the quest and he will reward you with a jug of wine as well as tell you his and the professor's real name.\nAccess to the grappling shortcut rock outside the Observatory.\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"2"},{"time":"1.5 hours","required-quests":"The Fremennik Trials","required-skills":"Level 40 Firemaking, Level 50 Woodcutting, The ability to defeat a level 100 monster.","reward":"12,000 Defence experience\n20,000 coins\n4 cut rubies\nAccess to a cave where you can fight brine rats.\nA piece of parchment telling you of other shipwrecks with more treasure. (This extra treasure is currently not available in the game)","questPoints":"1"},{"time":"3 hours","required-quests":"Rune Mysteries, Shilo Village","required-skills":"Level 25 Crafting, Level 18 Herblore, Level 36 Agility, Level 30 Smithing","reward":"Two experience lamps giving 10,000 experience to any skill of your choice. Skill must be at least level 30.\nA steel key ring\nThe ability to make Guthix rest tea.\nThe ability to craft pot lids.\nAccess to the gnome glider route to the Feldip Hills.","questPoints":"2"},{"time":"1 hours","required-quests":"Reward:","required-skills":"Ability to use the pay-fare option to and from Karamja.","reward":"Ability to use the pay-fare option to and from Karamja.\nAccess to One-Eyed Hector's Treasure Chest (contains a gold ring, an emerald, and 450 coins).","questPoints":"2"},{"time":"1.5 hours","required-quests":"Reward:","required-skills":"700 coins","reward":"700 coins\nFree passage through the Lumbridge - Al Kharid toll gate from now on.\n(Members) Access to the Sorceress's Garden Thieving minigame.","questPoints":"3"},{"time":"1 hours","required-quests":"Reward:","required-skills":"2,425 Mining experience","reward":"2,425 Mining experience\nArdougne teleport scroll, reading it unlocks the Ardougne Teleport with 51 Magic and use of the Ardougne teletab.","questPoints":"1"},{"time":"1.5 hours","required-quests":"Reward:","required-skills":"1406 Prayer exp","reward":"1406 Prayer exp\nWolfbane dagger, prevents the citizens of Canifis from transforming into werewolves when attacked.\nRoute to Canifis and Morytania.\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"1"},{"time":"1 hours.","required-quests":"Reward: None","required-skills":"Quest points gained upon completion: 5","reward":"","questPoints":"5"},{"time":"1 hours.","required-quests":"Reward:","required-skills":"The ability to mine rune essence.","reward":"The ability to mine rune essence.\nAn air talisman\nThe ability to use lamps and books of knowledge from random events on Runecraft.\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"1"},{"time":"1.5 hours","required-quests":"Reward:","required-skills":"500 Cooking experience","reward":"500 Cooking experience\nPrayer 500 Prayer experience","questPoints":"1"},{"time":"3.5 hours","required-quests":"Rag and Bone Man I, Horror from the Deep, Creature of Fenkenstrain, Zogre Flesh Eaters, Waterfall Quest","required-skills":"Level 40 slayer, Level 20 Defence (and you must have done the little Mogre mini-quest to have access to fighting the mogres). Also, you must have the ability to kill monsters that are up to level 88.","reward":"5,000 Prayer experience\nBonesack & Ram skull helm","questPoints":"1"},{"time":"3.5 hours","required-quests":"Icthlarin's Little Helper, The Giant Dwarf started to access to Keldagrim","required-skills":"Others: You must have a cat or hellcat but not overgrown cats.","reward":"4,500 Thieving experience\nA rat pole\nThe ability to train overgrown cats into wily and lazy cats.\nThe ability to name your wily or lazy cat (up to six letters long).\nAccess to the Rat Pits.\nThe ability to use the Grouping teleport to the rat pits in Port Sarim, Ardougne, Varrock, and Keldagrim.","questPoints":"2"},{"time":"25 hours","required-quests":"175 Quest Points, Cook's Assistant, Fishing Contest, Goblin Diplomacy, Big Chompy Bird Hunting, Murder Mystery, Nature Spirit, Witch's House, Gertrude's Cat, Shadow of the Storm, Monkey Madness I, Desert Treasure, Horror from the Deep, Started Legends' Quest up until  gaining access to the Kharazi Jungle.","required-skills":"Level 70 Cooking, Level 50 Firemaking, Level 48 Agility, Level 50 Mining, Level 53 Fishing, Level 53 Thieving, Level 25 Herblore, Level 59 Magic, Level 40 Smithing, Level 40 Ranged, Level 40 Crafting, Level 10 Fletching, Level 36 Woodcutting, Higher Combat level is recommended.","reward":"In total, completing all 10 subquests for \"Recipe for Disaster\" awards:\n1,000 Slayer experience\n28,000 Cooking experience\n1,000 Farming experience\n3.500 Crafting experience\n1,000 Fishing experience\n1,000 Smithing experience\n2,500 Magic experience\n1,500 Woodcutting experience\n1,500 Ranged experience\n4,000 Hitpoints experience\n10,000 Agility experience\nAn experience lamp, which grants 20,000 experience to any skill above 50 (can be banked for later use)\nAccess to the following areas: Mogre Camp, Evil Chicken's Lair.\nAbility to dive for crabs.\nAbility to cook crab meat.\nAbility to catch Hell-Rats.\nAbility to own a hellcat.\nAbility to add coloured spices to stews of any sort.\nAbility to use the boat trip to travel between Karamja and Feldip Hills.\nApe Atoll Teleport spell\nFull access to Culinaromancer's Chest.\nAccess to Kitchen weaponry.\nAccess to the banking chest (under Lumbridge Castle).\nAccess to a food store in the Chest.\nAccess to buy Barrows Gloves.","questPoints":"10"},{"time":"0.5 hours","required-quests":"Cook's Assistant","required-skills":"Level 10 cooking","reward":"The invitation to the feast of a lifetime!\nAccess to the Culinaromancer's Chest (after watching the cut scene in the feast room).","questPoints":"1"},{"time":"1 hours","required-quests":"Recipe for Disaster - Starting Out, Fishing Contest","required-skills":"Reward:","reward":"1,000 Slayer experience\n1,000 Cooking experience\nDwarven Rock Cake\nFurther access to the Culinaromancer's Chest","questPoints":"1"},{"time":"1 hours","required-quests":"Recipe for Disaster - Starting Out","required-skills":"Level 31 Cooking","reward":"1,000 Cooking experience\n1,000 Crafting experience\n1,000 Fishing experience\n1,000 Smithing experience\nThe ability to go diving and fight crabs (you need your diving apparatus)\nThe ability to cook crab meat (heals 10 hitpoints in 5 bites)\nThe ability to kill crabs to get their shells and claws, which can be made into a helmet and gloves with a chisel\nFurther access to the Culinaromancer's Chest","questPoints":"1"},{"time":"1 hours","required-quests":"Recipe for Disaster - Starting Out, Goblin Diplomacy","required-skills":"Reward:","reward":"1,000 Cooking experience\n1,000 Farming experience\n1,000 Crafting experience\nFurther access to the Culinaromancer's Chest.","questPoints":"1"},{"time":"1.5 hours","required-quests":"Recipe for Disaster - Starting Out, Big Chompy Bird Hunting","required-skills":"Level 41 Cooking, Level 20 Firemaking","reward":"1,500 Woodcutting experience\n1,500 Cooking experience\n1,500 Crafting experience\n1,500 Ranged experience\nThe ability to use the boat trip to travel between Karamja and the Feldip Hills (you must pay a fee of chompies or exotic herbs).\nFurther access to the Culinaromancer's Chest.","questPoints":"1"},{"time":"1.5 hours","required-quests":"Recipe for Disaster - Starting Out, Big Chompy Bird Hunting, Biohazard, Demon Slayer, Murder Mystery, Nature Spirit, Witch's House","required-skills":"Level 40 Cooking","reward":"2,500 Cooking experience\n2,500 Magic experience\nFurther access to the Culinaromancer's Chest.","questPoints":"1"},{"time":"2 hours","required-quests":"Recipe for Disaster - Starting Out, Gertrude's Cat, Shadow of the Storm","required-skills":"Level 25 Cooking","reward":"7,000 Cooking experience\nThe ability to catch hellrats to get a Hellcat.\nThe ability to have your cat fight Hell-Rat Behemoths.\nThe ability to add coloured spices to stew by catching hellrats (Spicy stews can boost and lower certain stats).\nFurther access to the Culinaromancer's Chest.","questPoints":"1"},{"time":"2 hours","required-quests":"107 Quest Points,  Recipe for Disaster - Starting Out, Waterfall Quest, Started Legends' Quest up until  gaining access to the Kharazi Jungle.","required-skills":"Level 25 Cooking, The ability to defeat a level 227 Black dragon (Can be safespotted.).","reward":"4,000 Cooking experience\n4,000 Hitpoints experience\nAccess to the Evil Chicken's Lair, where you can fight black dragons.\nFurther access to the Culinaromancer's Chest.","questPoints":"1"},{"time":"2 hours","required-quests":"Recipe for Disaster - Starting Out, Monkey Madness I","required-skills":"Level 70 Cooking, Level 48 Agility, The ability to defeat a level 84 Big Snake.","reward":"10,000 Cooking experience\n10,000 Agility experience\nApe Atoll Teleport spell\nFurther access to the Culinaromancer's Chest.","questPoints":"1"},{"time":"1 hours","required-quests":"175 Quest Points,  Recipe for Disaster - Starting Out, Recipe for Disaster - Subquest I: The Mountain Dwarf, Recipe for Disaster - Subquest II: Pirate Pete, Recipe for Disaster - Subquest III: Goblin Generals, Recipe for Disaster - Subquest IV: Skrach Uglogwee, Recipe for Disaster - Subquest V: Lumbridge Guide, Recipe for Disaster - Subquest VI: Evil Dave, Recipe for Disaster - Subquest VII: Sir Amik Varze, Recipe for Disaster - Subquest VIII: King Awowogei","required-skills":"None but higher combat lelve is recommended for defeat all enemies without Prayer.","reward":"An experience lamp, which grants 20,000 experience to any skill above 50 (can be banked for later use)\nFull access to the Culinaromancer's Chest.","questPoints":"1"},{"time":"2 hours","required-quests":"Black Knights' Fortress, Druidic Ritual","required-skills":"None but be able to defeat a Level 20 without any equipment or items.","reward":"1,000.5 Prayer experience\n1,000.5 Agility experience\n1,000.5 Herblore experience\nAccess to initiate armour. You will be given a sallet for free, and you can buy subsequent sallets from Sir Tiffy Cashien for 6,000 coins, the cuisse for 8,000 coins, the hauberk for 10,000 coins, or the full set for 20,000 coins. It is aesthetically similar to white armour, with a gold trim.\nThe Gaze of Saradomin - When you die, you will have the option of returning to Falador instead of Lumbridge. Talk to Sir Tiffy Cashien to change your spawn point at any time.\nIf you were a male at the start of the quest, you'll be given your 3,000 coins back, as well as a free Makeover voucher to change back.","questPoints":"1"},{"time":"3 hours","required-quests":"Underground Pass","required-skills":"Level 10 Crafting, Level 56 Agility, The ability to defeat a level 110 Tyras guard (can be safespotted).","reward":"13,750 Agility experience\n15,000 coins\nAccess to the elven kingdom of Tirannwn and the overpass of Arandar.\nThe ability to wield the dragon halberd (With level 60 Attack and 30 Strength).\nThe ability to charter a ship to Port Tyras.\nThe ability to use Iorwerth camp teleport scrolls.\nThe ability to use Zul-Andra teleport scrolls and battle Zulrah","questPoints":"3"},{"time":"2 hours","required-quests":"Regicide, Waterfall Quest","required-skills":"Must be able to defeat a level 84 without weapons, runes or armour.","reward":"10,000 Strength experience\nCrystal shield or bow with 500 charges","questPoints":"1"},{"time":"3 hours","required-quests":"Skills: Level 40 Agility, Level 40 Slayer","required-skills":"Quests: Throne of Miscellania","reward":"20,000 Coins\n5,000 Agility experience\n5,000 Slayer experience\n5,000 Hitpoints experience\nEnhanced rewards from Managing Miscellania","questPoints":"1"},{"time":"2 hours","required-quests":"Zogre Flesh Eaters","required-skills":"Level 40 Farming, Level 50 Fishing, Level 47 Prayer, Level 42 Crafting, Level 42 Slayer","reward":"7,000 Fishing experience\n7,000 Prayer experience\n7,000 Farming experience\nThe Holy wrench (while in your inventory, this grants more prayer points when drinking a prayer potion)","questPoints":"2"},{"time":"1 hours.","required-quests":"Reward: 150 Crafting experience, 60 coins","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"1 hours.","required-quests":"Reward:","required-skills":"600 coins","reward":"600 coins\nAdditional rewards when talking with Historian Minas in the Varrock Museum: 5 Kudos, Antique lamp awarding 1,000xp in a skill of at least level 20.","questPoints":"1"},{"time":"1 hour","required-quests":"Skills: Level 15 Smithing","required-skills":"Reward:","reward":"6,000 Smithing experience\nAccess to the Giants' Foundry minigame","questPoints":"1"},{"time":"2 hour","required-quests":"Skills: 69 Agility, 64 Thieving, 56 Hunter","required-skills":"Quests: Making Friends with My Arm, The General's Shadow, Devious Minds, Hazeel Cult","reward":"60,000 Agility experience\n50,000 Thieving experience\n40,000 Hunter experience\nAccess to the Ghorrock Dungeon\nAccess to a stronger version of the Strange Creature, the Phantom Muspah","questPoints":"2"},{"time":"1.5 hours","required-quests":"Skills: Level 31 Prayer, The ability to run past level 172 black demons and level 64 poison spiders.","required-skills":"Others: Completed the Miniquest Alfred Grimhand's Barcrawl","reward":"6,625 Strength experience\nThe ability to have Thormac turn a battlestaff into a mystic staff for 40,000 coins.","questPoints":"1"},{"time":"1 hours","required-quests":"Skills: Level 30 Firemaking","required-skills":"Reward:","reward":"7,175 Fishing experience\nAccess to the Fishing Platform\nOyster pearls","questPoints":"1"},{"time":"2-3 hours","required-quests":"Priest in Peril","required-skills":"Level 15 Herblore, Level 20 Crafting, The ability to defeat 5 level 40 Loar Shades.","reward":"2,000 Herblore experience\n2,000 Crafting experience\nAbility to play the Shades of Mort'ton minigame.\nAbility to use the Shades of Mort'ton minigame teleport.\nBonus: If you take the Diary of Herbi Flax to the Apothecary in Varrock, you'll get an extra 335 Herblore experience (can only be done once).","questPoints":"3"},{"time":"2 hours","required-quests":"Demon Slayer, The Golem","required-skills":"Level 30 Crafting, The ability to defeat a level 100 demon.","reward":"10,000 experience in any combat skill other than Prayer.\nSilverlight turns into the Darklight sword - it has a special attack and is even more powerful against demons. It costs slightly more to replace.\nSix cut gems: two sapphires, two rubies and two emeralds, if you use a hammer and chisel on the demon's throne and had not yet removed them during The Golem.","questPoints":"1"},{"time":"1 hour","required-quests":"Reward: 3100 gp","required-skills":"Quest points gained upon completion: 4","reward":"","questPoints":"4"},{"time":"3 hours","required-quests":"Jungle Potion","required-skills":"Level 32 agility and level 20 crafting.","reward":"3,875 Crafting experience\nAccess to Shilo Village.\nAbility to quick travel to Shilo Village using the cart near the Brimhaven docks.\nAfter completing the quest, you can sell every item you obtained during the quest to Yanni Salika in Shilo Village for 2,000 - 100 each for the stone-plaque, tattered scroll, crumpled scroll, Bervirius notes and the bone key, 500 for the locating crystal, and 1000 for the beads of the dead.\nAbility to mine the gem rocks in Shilo Village mine.","questPoints":"2"},{"time":"3 hours","required-quests":"Vampyre Slayer, A Taste of Hope","required-skills":"Level 62 Woodcutting, Level 60 Fletching, Level 56 Crafting, Level 52 Agility, Level 50 Slayer, Level 50 Attack, Level 49 Magic","reward":"Access to Darkmeyer\nAccess to the Daeyalt Essence Mine\nAccess to the Hallowed Sepulchre\nA tome of experience, granting 15,000 experience to any skill. (level 60 or higher). This reward can be utilised three times and may be used for the same skill.\nThe Blisterwood flail\nDarkmeyer teleport via Drakan's medallion\nBoat travel between Burgh de Rott, Slepe and the Icyene Graveyard","questPoints":"2"},{"time":"5 hours","required-quests":"Mourning's End Part II, Making History","required-skills":"Level 70 Agility, Level 70 Construction, Level 70 Farming, Level 70 Herblore, Level 70 Hunter, Level 70 Mining, Level 70 Smithing, Level 70 Woodcutting, 75 Magic to wield the Trident of the swamp in the final fight is recommended.","reward":"20,000 Agility experience\n20,000 Construction experience\n20,000 Farming experience\n20,000 Herblore experience\n20,000 Hunter experience\n20,000 Mining experience\n20,000 Smithing experience\n20,000 Woodcutting experience\nAccess to Prifddinas\nAbility to fight Zalcano\nAccess to The Gauntlet\nAccess to Trahaearn Mine\nAccess to Iorwerth Dungeon\nAbility to change respawn point to Prifddinas\nAbility to move Player Owned House to Prifddinas\nAbility to teleport to Prifddinas with a teleport crystal\nAbility to make divine potions\nAbility to make crystal tools, armour and weaponry","questPoints":"4"},{"time":"2 hours","required-quests":"Skills: Level 33 Magic, Level 37 Ranged, Level 37 Mining, Level 37 Thieving","required-skills":"Reward:","reward":"8,000 Prayer experience\n1,000 Thieving experience\n1,000 Magic experience\nAccess to Nardah's fountain for water and the shrine: Praying at the statuette will fill your Hitpoints, temporarily boost it, cure poison and venom, restore your prayer points, restore your run energy and your special attack.\nRobe of elidinis","questPoints":"2"},{"time":"3 hours","required-quests":"100 Quest Points, One Small Favour, Garden of Tranquillity","required-skills":"Level 66 Magic, Level 62 Cooking, Level 62 Fishing, Level 45 Smithing, Level 42 Firemaking, Level 40 Crafting","reward":"15,000 Magic experience\n10,000 Prayer experience\n10,000 Fishing experience\n25,000 coins\nAccess to the Piscatoris Fishing Colony\nThe ability to fish monkfish\nThe ability to use Skeleton Mages for training\nAccess to the following items from Malignius Mortifer upon request: A brown apron, Bone seeds (requires an airtight pot)","questPoints":"2"},{"time":"1 hours","required-quests":"Reward: Access to Yusuf's bank in the Corsair Cove.","required-skills":"Quest points gained upon completion: 2","reward":"","questPoints":"2"},{"time":"1 hours","required-quests":"Reward: 12,725 Smithing experience, A blurite sword (if you got Thurgo to make you an extra one), The ability to smelt blurite ore into blurite bars (members only)","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"1 hour","required-quests":"Reward:","required-skills":"1,125 Prayer experience","reward":"1,125 Prayer experience\nGhostspeak amulet (keep for Creature of Fenkenstrain)","questPoints":"1"},{"time":"1 hours","required-quests":"Skills: 12 Hunter","required-skills":"Quests: Client of Kourend","reward":"2,000 coins\n1,500 Hunter experience\n500 Runecraft experience\nArceuus favour certificate. Reading it grants 10% Arceuus favour.\nA page for Kharedst's memoirs, 'A dark disposition.' It teleports players to the centre of Arceuus.","questPoints":"1"},{"time":"1 hour","required-quests":"Enter the Abyss Miniquest","required-skills":"Level 10 Runecrafting","reward":"5,000 Runecrafting experience\nAn additional 4,210 Runecraft XP is gained during the quest, for a total of 9,210 XP\nAccess to the Guardians of the Rift minigame\nA medium pouch (if not already obtained)","questPoints":"1"},{"time":"1 hour","required-quests":"Skills: Level 20 Farming","required-skills":"Reward:","reward":"10,000 Farming experience","questPoints":"1"},{"time":"1 hours","required-quests":"Skills: 18 agility","required-skills":"Quests: Client of Kourend","reward":"1,500 Agility experience\n4,000 coins\nHosidius favour certificate. Reading it grants 10% Hosidius favour.\nA page for Kharedst's memoirs, 'Lunch by the lancalliums'. It teleports players to just east of the Hosidius Kitchen.","questPoints":"1"},{"time":"3.5 hours","required-quests":"Skills: Level 25 Thieving, Level 10 Agility, Level 10 Herblore","required-skills":"Reward:","reward":"15,300 Mining exp\n2,000 Herblore exp\n2 gold bars\nShow the museum curator the Level 3 certificate to choose between something to drink (Fruit blast) or something to eat (chocolate cake). Get the cake for Desert Treasure or the fruit blast for recipe for disaster. Make sure that you go through the dialogue for each one that you give it or he will not give you a chance to pick which reward you want and you will receive nothing.\nThe ability to do Varrock Museum specimen cleaning to obtain a Digsite pendant.\nThe Ancient talisman can be viewed in the Digsite Exhibit at the museum on the ground floor.\nPreviously granted the ability to choose the book of darkness after completion of Horror from the Deep.","questPoints":"2"},{"time":"2 hours","required-quests":"The Grand Tree","required-skills":"Level 5 Construction, Level 46 Magic","reward":"12,000 Magic experience\n2,500 Woodcutting experience\n6,000 Runecraft experience\n250 Construction experience\nA crystal saw seed — Either take it to Ilfeen in Tirannwn or use it on the singing bowl by Brimstail to get an enchanted crystal\nsaw. It allows items (that require a saw) to be made three levels above your Construction. It has a limited number of charges (28), but the recharge is free - use the bowl again.\nUsing the crystal seed with the singing bowl and getting a crystal saw is a medium task in the Western Provinces Area Achievement Diary.","questPoints":"2"},{"time":"2 hours","required-quests":"Skills: Level 30 Thieving","required-skills":"Reward:","reward":"15,000 Thieving experience\n500 coins\nAn oak blackjack\nThe desert disguise\nA willow blackjack (as a drop from the tough guy)\nAn adamant scimitar (as a drop from the bandit champion)\nAccess to the Rogue Trader minigame – Completing this will allow Ali Morrisane to sell blackjacks, various runes, and different clothing from around the Kharidian Desert.\nCan now steal from villagers, bandits and Menaphite Thugs.","questPoints":"1"},{"time":"2 hours","required-quests":"Client of Kourend","required-skills":"Others: 20% Lovakengj favour","reward":"500 Mining experience\n500 Smithing experience\n6,000 coins\nLovakengj favour certificate. Reading it grants 10% Lovakengj favour.\nA page for Kharedst's memoirs, 'Jewellery of jubilation.' It teleports players north-east of the bank in Lovakengj.","questPoints":"1"},{"time":"2 hours","required-quests":"The Fremennik Isles, Lunar Diplomacy, Mountain Daughter, Heroes' Quest","required-skills":"Level 65 Crafting, Level 60 Slayer, Level 60 Smithing, Level 60 Fishing, Level 55 Runecraft","reward":"V's shield\nAccess to the Island of Stone\nAbility to kill a Basilisk Knight as a Slayer Task.\nA Fremennik honorific, Dräpare, added to the player's Fremennik name.\nAbility to create and equip the Neitiznot faceguard.\n15,000 Slayer experience\n15,000 Crafting experience\n5,000 Runecraft experience","questPoints":"2"},{"time":"3 hours","required-quests":"The Fremennik Trials","required-skills":"Level 20 Construction, Level 40 Agility, Level 46 Crafting, Level 56 Woodcutting,","reward":"5,000 Construction experience\n5,000 Crafting experience\n10,000 Woodcutting experience\nTwo lots of Combat level 10,000 Combat experience (choose between Strength Strength, Attack Attack, Defence Defence or Hitpoints Hitpoints).\nA Fremennik royal helm known as the helm of neitiznot, which is the equivalent of a berserker helm with a +3 Prayer bonus, slightly better Magic and crush Defence, and no negative bonuses. If a player loses the helm, they can talk to Mawnis Burowgar to buy another one for 50,000 coins.\nAccess to Arctic Pine trees.\nAccess to an island with a runite rock north-east of Neitiznot, which also has seven (7) coal rocks nearby.\nAccess to the Jatizso mine, which contains up to adamantite rocks.\nAround 20,000 coins in assorted rewards during quest.\nThe banks in Neitiznot and Jatizso are close to water, range, furnace, fishing spots, mining ores; a spinning wheel is also nearby.\nIf the jester outfit is lost, a player can retrieve another one from the chest behind King Gjuki Sorvott IV's throne.\nLearn the ability to create yak-hide armour and Neitiznot shields.\nThe Contraband Yak Produce shop is available on Jatizso if a player refunds the 5,000 coin tax to Vanligga Gastfrihet, who is north of the king.","questPoints":"1"},{"time":"3 hours","required-quests":"Skills: Level 40 woodcutting, 40 crafting, 25 fletching","required-skills":"Ability to defeat a level-69 Draugen.","reward":"2812.4 Agility experience\n2812.4 Attack experience\n2812.4 Crafting experience\n2812.4 Defence experience\n2812.4 Fishing experience\n2812.4 Fletching experience\n2812.4 Hitpoints experience\n2812.4 Strength experience\n2812.4 Thieving experience\n2812.4 Woodcutting experience\nAccess to the islands of Miscellania, Etceteria, Neitiznot, and Jatizso along with access to the facilities in Rellekka.\nAbility to wear the Fremennik warrior, berserker, archer, and farseer helms.\nAbility to have Fossegrimen create the enchanted lyre(i).\nJarvald will charge no fee for travelling to Waterbirth Island.","questPoints":"3"},{"time":"2 hours","required-quests":"Skills: 33 Magic, 16 Firemaking, 14 Thieving, 12 Crafting","required-skills":"Reward:","reward":"2,500 Mining experience\n2,500 Smithing experience\n2,500 Crafting experience\n1,500 Magic experience\n1,500 Thieving experience\n1,500 Firemaking experience","questPoints":"2"},{"time":"1 hours","required-quests":"Skills: 20 Crafting, 25 Thieving","required-skills":"Reward:","reward":"1,000 Thieving experience\n1,000 Crafting experience\n2 cut rubies, emeralds, and sapphires (collect these by using a chisel and hammer on the throne)\nUnlock the carpet ride from Shantay Pass to Uzer.\nBlack Mushroom Ink (Made during Quest, used to paint desert clothing black for Shadow of the Storm)","questPoints":"1"},{"time":"2 hours","required-quests":"Skills: 25 Agility, The ability to defeat a level 172 Black demon (safespottable for Ranged and Magic or melee using a halberd).","required-skills":"Reward:","reward":"18,400 Attack experience\n7,900 Agility experience\n2,150 Magic experience\nAccess to the mine under the Grand Tree.\nAccess to the Gnome glider transportation system.\nAbility to use the Agility shortcut from the Grand Tree to the Barbarian Outpost (with 37 Agility).\nAbility to use the Spirit Tree in the Stronghold after the completion of Tree Gnome Village.\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum.","questPoints":"5"},{"time":"3 hours","required-quests":"Creature of Fenkenstrain, Cabin Fever, Recipe For Disaster - Pirate Pete","required-skills":"Level 16 Crafting, Level 30 Construction, Level 50 Prayer","reward":"6,000 Prayer experience\n3,000 Crafting experience\n2,000 Construction experience\nBlessed lamp (Skills 5,000 experience in a chosen skill above level 30 and can be placed in your bank).\nBarrelchest anchor (To repair your barrelchest anchor, return to Mos Le'Harmless and make sure you have a book o' piracy in your inventory; then, go to the docks south of the bank and talk to \"Smith.\" He can fix your anchor for 230,000 coins.)\nPrayer book","questPoints":"2"},{"time":"2 hours","required-quests":"Skills: 17 Thieving, 49 Crafting","required-skills":"Reward:","reward":"1,000 Thieving experience\n9,000 Crafting experience\nAbility to buy pink dye from Betty.\nA secret reward from Bert - He simply loves sand, and wasn't in the job for the money. He will ship 84 buckets of sand to your bank if you talk to him after the quest. This can be done once per day (UTC). Asking Bert to take sand to your bank is also an Ardougne Medium task.\nAccess to the Wizards' Guild rune store.","questPoints":"1"},{"time":"2 hours","required-quests":"Rune Mysteries, Goblin Diplomacy","required-skills":"Level 17 Mining, Level 13 Agility, Level 13 Thieving","reward":"3,000 Mining experience\nThe ability to use the Goblin Bow and Goblin Salute emotes.\nAccess to the Dorgesh-Kaan mine.\nA ring of life\nAccess to Nardok's Bone Weapon's store where players can purchase the Dorgeshuun crossbow, Bone bolts and other bone weapons.","questPoints":"1"},{"time":"1 hours","required-quests":"Skills: Level 20 Thieving","required-skills":"Quests: Client of Kourend","reward":"2,000 Thieving experience\n2,000 coins\nAccess to The Warrens.\nPiscarilius favour certificate. Reading it grants 10% Piscarilius favour.\nA page for Kharedst's memoirs, 'The fisher's flute.' It teleports players to the centre of Port Piscarilius.","questPoints":"1"},{"time":"2 hours","required-quests":"Wanted!, Sea Slug","required-skills":"Level 30 Crafting, Level 30 Runecrafting, Level 30 Slayer, Level 30 Thieving","reward":"3,500 Crafting experience\n3,500 Runecraft experience\n3,500 Thieving experience\nPromotion to Proselyte among the Temple Knights. This means you can buy and wear Proselyte armour with a greater Prayer bonus than Initiate. You can buy each piece individually, or buy the armour pack which, when opened, gives you the plate, helm, and legs/tassets all at once. The pack costs 25,000 coins.\nBuying the upgraded armour in separate pieces cost more: the helm costs 8,000 coins, the platelegs and plateskirt cost 10,000 coins, and the platebody costs 12,000 coins for a total of 30,000 coins. Required for the Falador Hard Diary.","questPoints":"1"},{"time":"3 hours","required-quests":"Jungle Potion","required-skills":"Level 30 Cooking, Level 15 Agility, Level 5 Fishing (Level 65 Fishing if you want to catch and cook your own Karambwan, but it's not required.)","reward":"5,000 Cooking experience\n5,000 Fishing experience\n2,500 Attack experience\n2,500 Strength experience\n2,000 Coins\nA karambwan-poisoned rune spear from talking to Tamayu in the village after the quest. Note: you will also receive combat experience.\nAccess to Tamayu's Spear Stall (sells cleaning cloths).\nAccess to Tiadeche's Karambwan Stall (sells raw karambwans and karambwan vessels).\nThe ability to pray at the newly repaired tribal statue (works like an altar) from talking to Tinsay and Tiadeche in the village after the quest.\nThe ability to catch and cook karambwans from talking to Tinsay in the village after the quest.\nThe ability to fight the Shaikahan (level 83 - you need a kp spear to hit it).\nThe ability to use Tai bwo wannai teleport scrolls.\nYou can also take part in the Smithing section of Otto's Barbarian Training.","questPoints":"2"},{"time":"1.5 hours","required-quests":"Client of Kourend","required-skills":"Level 16 Strength, Level 10 Mining.","reward":"8,000 coins\nShayzien favour certificate. Reading it grants 10% Shayzien favour.\nA page for Kharedst's memoirs, 'History and hearsay.' It teleports players to the Graveyard of Heroes south-west of the Shayzien bank.\nAbility to fight the Corrupt Lizardman in the Nightmare Zone.\n3 Xerician fabric (dropped by Corrupt Lizardman)","questPoints":"1"},{"time":"1.5hours","required-quests":"Quest: 43 Quest Points","required-skills":"Level 49 Firemaking, Level 20 Crafting, Level 20 Mining.","reward":"1,000 Crafting experience\nAbility to play the Tears of Guthix (minigame) once a week","questPoints":"1"},{"time":"1.5 hours","required-quests":"Skills: Level 42 Thieving, Level 40 Ranged","required-skills":"Reward:","reward":"10,500 Ranged experience\n8,000 Fletching experience\nArmadyl pendant (if you sided with Lucien, you must kill Guardians of Armadyl to obtain it)\nPendant of Lucien, which grants access to a door in the Temple of Ikov\nOptional; Boots of lightness\nOptional; Shiny key, for a shortcut between the Temple of Ikov and McGrubor's Wood\nCompleting this quest awards the player with 5 kudos which can be claimed by talking to Historian Minas in the Varrock Museum","questPoints":"1"},{"time":"2 hours","required-quests":"Heroes' Quest, The Fremennik Trials","required-skills":"It's an advantage to have either Level 35 herblore or Level 45 woodcutting to earn approval.","reward":"Management of Miscellania\n10,000 coins (inside the Miscellania coffers)\nThe ability to teleport to Miscellania using a ring of wealth.","questPoints":"1"},{"time":"2 hours","required-quests":"Skills: Level 10 Fletching, Level 20 Smithing, Be able to kill a level 47 Mercenary Captain.","required-skills":"Reward:","reward":"4,650 Experience in your choice of two skills (you may pick same skill twice): Agility, Fletching, Smithing, or Thieving.\nThe ability to smith darts.\nThe wrought iron key - allows access to a special door inside the Desert Mining Camp, which has several higher tier ores inside, including mithril ore and adamantite ore.\nFull slave robes\n6 bronze darts","questPoints":"2"},{"time":"2 hours","required-quests":"Skills: Level 10 Construction","required-skills":"Reward:","reward":"1,000 Construction experience\n500 Crafting experience\n500 Thieving experience\nAccess to Creature Creation\nBuilder's costume","questPoints":"2"},{"time":"1.5 hours","required-quests":"Skills: Be able to kill a Level 112 Khazard warlord.","required-skills":"Reward:","reward":"11,450 Attack experience\nUse of spirit trees for transportation\nThe Gnome amulet","questPoints":"2"},{"time":"1 hours","required-quests":"Skills: Level 21 Thieving","required-skills":"Reward:","reward":"1,775 Thieving experience\n5 Swordfish","questPoints":"1"},{"time":"2 hours","required-quests":"Troll Stronghold","required-skills":"Level 28 Agility, The ability to defeat a level 171 Troll.","reward":"8,000 Agility experience\n4,000 Strength experience\n1 diamond, 2 rubies and 4 emeralds (all uncut)\nA sled (required to complete a hard and an elite clue scroll step)\nSledding route from Trollweiss Mountain","questPoints":"2"},{"time":"1.5 hours","required-quests":"Death Plateau","required-skills":"Level 15 Agility, The ability to defeat a level 113 Troll General (can be safespotted).","reward":"Law talisman (if you lose it, you can get another from Dunstan for 1000 coins)\nAbility to make law runes\nAccess to Trollheim and the Troll Stronghold (location)\nAbility to access the God Wars Dungeon","questPoints":"1"},{"time":"4 hours","required-quests":"Biohazard","required-skills":"Level 25 Ranged, Good Agility and Thieving Skills (Level 50+ Recommended), Be able to kill three level 91 demons.","reward":"3,000 Agility experience\n3,000 Attack experience\nIban's staff and use of the Iban Blast spell\nKlank's gauntlets","questPoints":"5"},{"time":"1 hours.","required-quests":"Reward: 4,825 Attack experience","required-skills":"Quest points gained upon completion: 3","reward":"","questPoints":"3"},{"time":"1 hours.","required-quests":"Reward: 325 Magic experience","required-skills":"Quest points gained upon completion: 1","reward":"","questPoints":"1"},{"time":"3 hours","required-quests":"32 Quest Points, Recruitment Drive, The Lost Tribe, Priest in Peril, The Miniquest Enter the Abyss","required-skills":"Reward:","reward":"5,000 Slayer experience\nAccess to the armoury of the White Knights (White equipment)","questPoints":"4"},{"time":"3 hours","required-quests":"Skills: Level 14 Herblore, Level 14 Magic, Level 15 Thieving, Level 25 Agility, Level 40 Mining, The ability to kill a Level 68 Ogre.","required-skills":"Reward:","reward":"15,250 Magic experience\n5,000 Coins\nA scroll, the reading of which gives you the ability to use Watchtower Teleport\nAccess to the ogre city (and Ogre Enclave where you can fight blue dragons. You will not need an extra nightshade to enter after the quest is complete.)","questPoints":"4"},{"time":"2 hours","required-quests":"Reward:","required-skills":"13,750 Strength experience","reward":"13,750 Strength experience\n13,750 Attack experience\n2 Diamonds\n2 Gold bars\n40 Mithril seeds","questPoints":"1"},{"time":"2 hours","required-quests":"Rune Mysteries","required-skills":"Level 35 Runecrafting","reward":"8,000 Runecraft experience\n2,000 Defence experience\nThe Beacon ring\nAccess to a shortcut to the chaos altar\nCompleting this quest awards the player with 5 Kudos which can be claimed by talking to Historian Minas in the Varrock Museum, while holding the Dagon'hai history book.","questPoints":"1"},{"time":"1 hours","required-quests":"Reward: 6,325 Hitpoints experience","required-skills":"Quest points gained upon completion: 4","reward":"","questPoints":"4"},{"time":"1 hours.","required-quests":"Reward:","required-skills":"200 coins","reward":"200 coins\nAntique lamp providing 300 experience in a skill of the player's choosing (can be reclaimed if lost or destroyed).\nA beginner clue scroll (only if the player does not have one already in their possession; can be claimed later if players had one in their possession already)","questPoints":"1"},{"time":"3 hours","required-quests":"Jungle Potion, Big Chompy Bird Hunting","required-skills":"Level 8 Herblore, Level 30 Ranged, Level 4 Smithing, It's recommended to have a Level 20+ Strength, Level 43 Prayer and Level 33 Fletching.","reward":"3 Ourg bones & 2 Zogre bones\n2,000 Fletching experience\n2,000 Ranged experience\n2,000 Herblore experience\nAbility to make Relicym's balm\nAbility to fletch Comp ogre bows and Brutal arrows\nAbility to wear Inoculation bracelets\nGive a 2 or 3 or 4 dose Relicym's balm to Uglug to gain access to ~ Uglug's stuffsies ~","questPoints":"1"}]